SIMISA@@@@@@@@@@JINX0D0t______
 
Wagon ( DR_BR_SR_5MT_73082
    Type ( Engine )
    WagonShape ( DR_BR_SR_5MT_73082.s )
    Size  ( 2.634m 4.151m 11.686m )


Include ( ..\\Common_Locomotives\\BR_5MT_wagon.inc )


Comment ( ************************ Lights (If used) ************************
            Included in this section - Type, Colour, Location, Size, Control, etc
          *********************************************************************** )

Comment ( ********************* Wagon Visual Effects *********************
                      Included in this section - Effect type, etc
          *********************************************************************** )

Effects(
SpecialEffects(
Comment(==== Steam Heating Hose Leak ====)
HeatingHoseFX(
0.3 0.6 5.5
0 1 0
0.16 )
 ))

Comment ( ******************** Freight and Load Animations (If used) ********************
                Included in this section - Freight Animation information, etc
          *********************************************************************** )

ORTSFreightAnims (
FreightAnimStatic (
SubType(Default)
Shape( "DR_BR_5MT_Extras.s" )
Offset( 0 0 0 ) ) )

)

 
Engine ( DR_BR_SR_5MT_73082

Effects (
SteamSpecialEffects (

WhistleFX (
0.0 3.692 2.717
0 0.8 0
0.2 )

SafetyValvesFX (
0 3.884 -2.821
0 0.95 0
0.2 )

SafetyValvesFX (
0 3.884 -2.821
0 -0.8 0
0.35 )

StackFX (
0 3.953 3.344
0 0.95 0
0.3 )
StackFX (
0 3.953 3.344
0 0.95 0
0.25 )
StackFX (
0 3.953 3.344
0 0.95 0
0.25 )

DrainpipeFX (
-1.5 1.258 -3.886
-0.4 -1 -0.2
0.05 )

CylindersFX (
-0.972 0.776 4.150
0 -0.4 1.4
0.1 )
CylindersFX (
0.972 0.776 4.150
0 -0.4 1.4
0.1 )
Cylinders2FX (
-0.972 0.774 4.050
0 -0.4 1.4
0.1 )
Cylinders2FX (
-0.972 0.774 4.050
0 -0.4 1.4
0.1 )

Injctors1FX (
1.00 0.34 -5.70
0 -1 -1
0.1 )
Injectors2FX (
-1.00 0.34 -5.70
0 -1 -1
0.1 )
)
)

Include ( ..\\Common_Locomotives\\BR_5MT_engine.inc )

HeadOut (  -1.4 3.0 -5.7 )

      Name ( "DR_BR_SR_5MT_73082" )

    Description (
        "British Rail Standard Class5 4-6-0 Tender engine number 73082 as preserved on the Nene valley Railway.\n"+
        "\n"+
        "(c) Dave Robinson\n"+
        " \n"
    )
    EngineOperatingProcedures (
        "The operating procedures for the engine.\n"+
        " \n"
    )
)